In [55]:
import pandas as pd
import matplotlib.pyplot as plt

df = pd.read_csv('C:/Users/tipqc/CPE311 - Paala/sales_data_raw.csv') # Loading the CSV file through Pandas
df.info() # Observing the sales dataset's structure
# In the following info, we can observe that the Transaction Date is in a string.
# This can cause issues in its data quality.
# We can convert this into a date data type.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     object
 1   CustomerID       10 non-null     object
 2   TransactionDate  10 non-null     object
 3   Product          10 non-null     object
 4   Quantity         10 non-null     int64
 5   Price            10 non-null     int64
 6   Discount         10 non-null     float64
dtypes: float64(1), int64(2), object(4)
memory usage: 692.0+ bytes

In [56]:
df.head(10) # Observing the values inside the dataset to gain insights.

  TransactionID CustomerID TransactionDate Product  Quantity  Price  Discount
0          T001       C001      2023-01-01  Widget         2     10      0.00
1          T002       C002      2023-01-05  Gadget         1     20      0.10
2          T003       C003      2023-01-07  Widget         3     10      0.00
3          T004       C002      2023-01-10   Gizmo         5     15      0.05
4          T005       C001      2023-01-12  Widget         1     10      0.00
5          T006       C004      2023-01-15  Gadget         2     20      0.20
6          T007       C005      2023-01-18  Widget         4     10      0.00
7          T008       C002      2023-01-20   Gizmo         3     15      0.10
8          T009       C003      2023-01-22  Widget         5     10      0.00
9          T010       C005      2023-01-25  Gadget         3     20      0.15

In [57]:
# SALES DATASET
# To convert the datatype of the specified attribute,
# we should use the pd.to_datetime() function.

df['TransactionDate'] = pd.to_datetime(df['TransactionDate'])
# Saving the conversion of string to datetime by using the
# column itself as the variable.

In [58]:
df.dtypes # Confirming the conversion of datatype

TransactionID              object
CustomerID                 object
TransactionDate    datetime64[ns]
Product                    object
Quantity                    int64
Price                       int64
Discount                  float64
dtype: object

In [59]:
df2 = pd.read_json('C:/Users/tipqc/CPE311 - Paala/customers_data.json')
# First, we load the customer dataset into a dataframe.
df2.info()
# We can observe from the given info that the
# JoinDate attribute is in a string datatype.
# This can cause issues in the data quality.
# The datatype can be converted into a datetime datatype
# to improve its data quality.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  5 non-null      object
 1   Name        5 non-null      object
 2   JoinDate    5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

In [60]:
df2.head()

  CustomerID     Name    JoinDate
0       C001    Alice  2022-12-01
1       C002      Bob  2022-11-15
2       C003  Charlie  2023-01-05
3       C004    Diana  2023-01-10
4       C005     Evan  2023-01-20

In [61]:
# CUSTOMERS DATASET
# To convert the datatype of the specified attribute,
# we should use the pd.to_datetime() function.
df2['JoinDate'] = pd.to_datetime(df2['JoinDate'])
# Saving the conversion of string to datetime by using the
# column itself as the variable.

In [62]:
df2.dtypes # Confirming the conversion of datatype

CustomerID            object
Name                  object
JoinDate      datetime64[ns]
dtype: object

In [63]:
def fta(df): # We load the dataset inside into the function
    final_trans_amount = (df['Quantity'] * df['Price']) * (1 - df['Discount'])
    # The formula saved in a variable "final_trans_amount"
    return final_trans_amount
    # The output of the function is the result of the formula.

In [64]:
df.head()

  TransactionID CustomerID TransactionDate Product  Quantity  Price  Discount
0          T001       C001      2023-01-01  Widget         2     10      0.00
1          T002       C002      2023-01-05  Gadget         1     20      0.10
2          T003       C003      2023-01-07  Widget         3     10      0.00
3          T004       C002      2023-01-10   Gizmo         5     15      0.05
4          T005       C001      2023-01-12  Widget         1     10      0.00

In [65]:
df['Product'].remove_duplicate()

AttributeError: 'Series' object has no attribute 'remove_duplicate'

In [66]:
df_unsaved = pd.read_csv('C:/Users/tipqc/CPE311 - paala/sales_data_raw.csv')
df_unsaved.info()
# An ETL pipeline is a process where raw datasets are observed and cleaned.
# Extract means extracting the raw dataset by loading it into a dataframe,
# analyze its attributes and datatypes; extracting chosen attributes to use.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     object
 1   CustomerID       10 non-null     object
 2   TransactionDate  10 non-null     object
 3   Product          10 non-null     object
 4   Quantity         10 non-null     int64
 5   Price            10 non-null     int64
 6   Discount         10 non-null     float64
dtypes: float64(1), int64(2), object(4)
memory usage: 692.0+ bytes

In [67]:
# Transform means to transform the chosen attributes such as filling the NaN values,
# changing the datatype of the attributes, renaming attributes, and so on.
df_unsaved['TransactionDate'] = pd.to_datetime(df['TransactionDate'])
df_unsaved.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     object
 1   CustomerID       10 non-null     object
 2   TransactionDate  10 non-null     datetime64[ns]
 3   Product          10 non-null     object
 4   Quantity         10 non-null     int64
 5   Price            10 non-null     int64
 6   Discount         10 non-null     float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 692.0+ bytes

In [90]:
df_unsaved_query = df_unsaved.query("`Product` == 'Widget'")

In [91]:
df_unsaved_query.head()

  TransactionID CustomerID TransactionDate Product  Quantity  Price  Discount
0          T001       C001      2023-01-01  Widget         2     10       0.0
2          T003       C003      2023-01-07  Widget         3     10       0.0
4          T005       C001      2023-01-12  Widget         1     10       0.0
6          T007       C005      2023-01-18  Widget         4     10       0.0
8          T009       C003      2023-01-22  Widget         5     10       0.0

In [93]:
df_unsaved_query.to_csv('C:/Users/tipqc/CPE311 - paala/salesdatasetwidget.csv')
# Load means to load these attributes into a separate dataframe,
# in order to analyze and gain insights from the cleaned dataset.

In [94]:
df_new_load = pd.read_csv('C:/Users/tipqc/CPE311 - paala/salesdatasetwidget.csv')
df_new_load.head()

,Unnamed: 0,TransactionID,CustomerID,TransactionDate,Product,Quantity,Price,Discount
0,0,T001,C001,2023-01-01,Widget,2,10,0.0
1,2,T003,C003,2023-01-07,Widget,3,10,0.0
2,4,T005,C001,2023-01-12,Widget,1,10,0.0
3,6,T007,C005,2023-01-18,Widget,4,10,0.0
4,8,T009,C003,2023-01-22,Widget,5,10,0.0

In [103]:
df_merged = pd.concat([df, df2]) # Concatenate both tables
df_merged.to_csv('C:/Users/tipqc/CPE311 - paala/new.csv', index=False)
# This function is to create a separate file where the combined table is saved.